void run_game1()
  {
  
    servo_down_open();
    fline_xl(70, 70, 0.75,  20);   
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่
   

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            fline(0, 0, 0.4, 10,'n','r',70, "a4", 30);            
            fline_2sensor(70, 70, 0.75, 0, "3:4","b0", 's', 0);
            
            goto can_2;   //---------------->>  ไปที่  can_2: 
          }
        else{}
    
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง
    bline_xl(72, 72, 0.72,  20) ;  

    //check_box();
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart
   
   ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 222222222222222
        
    servo_down_open();
    fline_xr(70, 70, 0.75,  20);  
     
    can_2:   //<<----------------<<  มาจาก goto can_2;
    
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่
    

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            bline_xl(72, 72, 0.72,  20) ;  
            fline(80,80, 0.63, 0, 'c', 'l',80, "a2", 20);
            
            goto can_3;   //---------------->>  ไปที่  can_3: 
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง 
    bline_xr(80, 80, 0.5,  20) ;  
       
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart

   ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 3333333333
   
    servo_down_open();
    fline(75, 75, 0.8, 0,'f','s',70, "a4", 1); 
    fline_2sensor(75, 75, 0.8, 0, "3:4","b0", 'p', 0);
    fline(72,72, 0.7, 0, 'c', 'l',80, "a2", 20);
    
          can_3:    //<<----------------<<  มาจาก goto can_3;
             
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่
 
    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            fline(0, 0, 0.4, 10,'n','r',70, "a4", 30);
            fline(80, 80, 0.6, 0,'c','p',70, "a4", 30); 
            
            goto can_4;   //---------------->>  ไปที่  can_4: 
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง 
    
    bline(75,75, 0.75, 0, 'c', 'l',80, "a3", 20);   
    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 'p', 0);
    
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart

       ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 4
        
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    fline(72,72, 0.7, 0, 'c', 'r',80, "a5", 20);  

           can_4:    //<<----------------<<  มาจาก goto can_4;
             
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            bline(80, 80, 0.6, 0,'c','l',70, "a2", 30); 
            fline_xl(70, 70, 0.75,  20); 
            
            goto can_5;   //---------------->>  ไปที่  can_5: 
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง 
    
    bline(80,80, 0.8, 0, 'c', 'r',80, "a4", 20); 
      
    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 'p', 0);
    
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart

    ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 5555
       
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    fline_xl(75, 75, 0.75,  20); 
      
             can_5:    //<<----------------<<  มาจาก goto can_5;
             
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            fline(0, 0, 0.4, 10,'n','r',70, "a4", 30);            
            fline_2sensor(70, 70, 0.75, 0, "3:4","b0", 's', 0); 
            
            goto can_6;   //---------------->>  ไปที่  can_6: 
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง 
    
    bline_xl(72, 72, 0.72,  20) ;  
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","26", 's', 0);

    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart
   
   ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 666
         
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    fline_xr(75, 75, 0.75,  20);   
    
           can_6:   //<<----------------<<  มาจาก goto can_6;
    
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            bline_xl(72, 72, 0.72,  20) ;  
            fline(80,80, 0.63, 0, 'c', 'l',80, "a2", 20);
            
            goto can_7;   //---------------->>  ไปที่  can_6: 
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง
     
    bline_xr(75, 75, 0.5,  20) ;    
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","26", 's', 0);
    
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart


    ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 7
        
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    
    fline(75,75, 0.75, 0, 'c', 'l',80, "a2", 20); 
       
          can_7:   //<<----------------<<  มาจาก goto can_6;
    
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            fline(0, 0, 0.4, 10,'n','r',70, "a4", 30);
            fline(75, 75, 0.75, 0,'c','p',70, "a4", 30); 
            
            goto can_8;   //---------------->>  ไปที่  can_8:   
          }
        else{}
        
    
    bline(80,80, 0.8, 0, 'c', 'l',80, "a3", 20);   

    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","26", 's', 0);
    
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart

       ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 8
        
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    
    fline(80,80, 0.63, 0, 'c', 'r',80, "a5", 20);    
    
           can_8:    //<<----------------<<  มาจาก goto can_8;
             
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            bline(75, 75, 0.75, 0,'c','l',70, "a2", 30); 
            fline_xl(75, 75, 0.75,  20); 
            
            goto can_9;   //---------------->>  ไปที่  can_9:  
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง  
    
    bline(75,75, 0.75, 0, 'c', 'r',80, "a4", 20);   

    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","26", 's', 0);
    
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart



    ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 9
        
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);

    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline_xl(75, 75, 0.75,  20);   
    
         can_9:    //<<----------------<<  มาจาก goto can_9;  
             
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            fline(0, 0, 0.4, 10,'n','r',70, "a4", 30);            
            fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 's', 0); 
            
            goto can_10;   //---------------->>  ไปที่  can_10:   
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง 
    
    bline_xl(75, 75, 0.75,  20) ; 
     
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);

    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","26", 's', 0);
    

    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart
   
   ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 10
        
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(70, 70, 0.75, 0, "3:4","b0", 'p', 0);
    
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);

    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline_xr(75, 75, 0.75,  20);   
    
         can_10:   //<<----------------<<  มาจาก goto can_10; 
    
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            bz(50); Motor(1, 1); delay(100);
            bline_xl(75, 75, 0.75,  20) ;  
            fline(0,0, 0.63, 10, 'c', 'l',80, "a3", 20);
            
            goto can_11;   //---------------->>  ไปที่  can_11:  
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง
    
    bline_xr(75, 75, 0.75,  20) ;
        
     fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 'p', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);

    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","26", 's', 0);
    
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart

    ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 11
        
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 'p', 0); 
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);

    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline(75,75, 0.75, 0, 'c', 'l',70, "a3", 20);

        can_11:   //<<----------------<<  มาจาก goto can_11;
    
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
              bz(50); Motor(1, 1); delay(100);
              bline(60,60, 1.2, 100, 'n', 's',80, "a4", 1);
              while(1)
                {
                      float error_L = map(mcp_b(3), min_mcp_b(3), max_mcp_b(3), 0, 30 );
                      float error_R = map(mcp_b(4), min_mcp_b(4), max_mcp_b(4), 0, 30 );
                      errors = error_L - error_R;  
                      I = 0;
                      previous_I = 0;
                      previous_error = 0;
                      P = errors;
                      I = I + previous_I;
                      D = errors - previous_error ;            
                      previous_I=I;
                      previous_error=errors  ;  
                      PID_output = (0.7 * P) + (0.0000015 * I) + (0.4* D); 
          
                      Motor(-(60 - PID_output),-(60 + PID_output));
                      if(mcp_f(0) < md_mcp_f(0))
                        {    
                                                 
                          Motor(60, 60);
                          delay(20);
                          break;
                        }  
                 }
                 
               do{Motor(60, -60);}while(mcp_f(7) > md_mcp_f(7));delay(10);
               do{Motor(60, -60);}while(mcp_f(3) > md_mcp_f(3));delay(10);
               do{Motor(60, -60);}while(mcp_f(3) < md_mcp_f(3));delay(10);
               do{Motor(60, -60);}while(mcp_f(3) > md_mcp_f(3));
               do{Motor(60, -60);}while(mcp_f(4) > md_mcp_f(4));
               Motor(-60, 60);delay(20);
               Motor(1, 1);delay(5);
               
            goto can_12;   //---------------->>  ไปที่  can_12:  
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง
    
    bline11_xl(75, 75, 0.5,  20) ; 
     
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);

    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","26", 's', 0);
      

    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart
   
   ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 12
        
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);

    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline(75,75, 0.75, 0, 'c', 'r',70, "a5", 20);
    
          can_12:   //<<----------------<<  มาจาก goto can_12;
    
    fline_ch_can(50, 50, 0.63, 400, 10);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
              bz(50); Motor(1, 1); delay(100);
              bline(60,60, 1.2, 100, 'n', 's',80, "a4", 1);
              while(1)
                {
                      float error_L = map(mcp_b(3), min_mcp_b(3), max_mcp_b(3), 0, 30 );
                      float error_R = map(mcp_b(4), min_mcp_b(4), max_mcp_b(4), 0, 30 );
                      errors = error_L - error_R;  
                      I = 0;
                      previous_I = 0;
                      previous_error = 0;
                      P = errors;
                      I = I + previous_I;
                      D = errors - previous_error ;            
                      previous_I=I;
                      previous_error=errors  ;  
                      PID_output = (0.7 * P) + (0.0000015 * I) + (0.4* D); 
          
                      Motor(-(60 - PID_output),-(60 + PID_output));
                      if(mcp_f(7) < md_mcp_f(7))
                        {    
                                                 
                          Motor(60, 60);
                          delay(30);
                          break;
                        }  
                 }
                 
               do{Motor(-60, 60);}while(mcp_f(0) > md_mcp_f(0));delay(10);
               do{Motor(-60, 60);}while(mcp_f(3) > md_mcp_f(3));
               do{Motor(-60, 60);}while(mcp_f(4) > md_mcp_f(4));
               Motor(60, -60);delay(10);
               Motor(1, 1);delay(5);
            goto can_13;   //---------------->>  ไปที่  can_13:  
          }
        else{}
        
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง
    
    bline12_xr(75, 75, 0.75,  20) ;
        
     fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);

    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);
    
    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","26", 's', 0);
    
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart

    ///////////////////////////////////////////////////////////////////////////เริ่มกล้อง 13
        
    servo_down_open();
    fline(75, 75, 0.75, 0,'f','s',70, "a4", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
    
    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);

    fline(75,75, 0.75, 0, 'c', 'p',70, "a5", 20);

    fline_2sensor(75, 75, 0.75, 0, "3:4","a0", 's', 0);
    fline_2sensor(75, 75, 0.75, 0, "3:4","b0", 'p', 0);
        
        can_13:   //<<----------------<<  มาจาก goto can_13;  
    
    fline_ch_can(40, 40, 0.63, 300, 0);  // วิ่งเข้าไปเช็คว่ามีกระป๋องหรือไม่

    if(dis.readRangeSingleMillimeters() > 150)  //ไม่มีกระป๋อง
          {
            no_can_ent = 1;
            fline(40,40, 0.63, 150, 'n', 'r',70, "a5", 20);
            goto can_ent;
          }
    fline_mision(40, 40, 0.73,  0);   // วิ่งเข้าไปคีบกระป๋อง   
     
         
    fline(30,30, 0.63, 50, 'n', 'r',70, "a5", 20);
    
    can_ent: 
    
    fline_2sensor(90, 90, 0.95, 0, "3:4","a0", 'p', 0);
    fline_2sensor(90, 90, 0.95, 0, "3:4","b0", 'p', 0);

    fline(90,90, 0.63, 0, 'c', 'p',70, "a5", 20);
    
    fline_2sensor(90, 90, 0.95, 0, "3:4","a0", 'p', 0);
    fline_2sensor(90, 90, 0.95, 0, "3:4","b0", 'p', 0);

    fline(90,90, 0.95, 0, 'c', 'p',70, "a5", 20);
    
    fline(75,75, 0.75, 0, 'f', 's',70, "a5", 1);
    fline_2sensor(75, 75, 0.75, 0, "3:4","26", 's', 0);

    if(no_can_ent == 1)
      {
        fline(90,90, 0.63, 0, 'c', 'p',70, "a5", 20);
        fline(50,50, 0.63, 0, 'c', 's',70, "a5", 1);
        Motor(50, 50); delay(150);
        Motor(1, 1); delay(1000);
        Motor(0, 0); delay(1000);
        goto _ent;
      }
      
    check_colorCan();   //---------------------------------->>  ตรวจสีสอบกระป๋อง  // code อยู่ใน tab sart


    

     bline(70,70, 0.63, 0, 'c', 's',70, "a5", 1);
     bline(70,70, 0.0, 200, 'n', 's',70, "a5", 20);

     _ent: delay(1000);


    
   
  }
